"Job Log" = "Jobblogg";
"Job Log2" = "Jobblogg";

"User ID" = "Användar-ID";
"User ID:" = "Användar-ID:";

"Job Type" = "Jobbtyp";
"Job Type:" = "Jobbtyp:";

"File Name" = "Filnamn";
"File Name:" = "Filnamn:";

"Password" = "Lösenord";
"Password:" = "Lösenord:";

"User Code" = "Användarkod";
"User Code:" = "Användarkod:";

"Time" = "Tid";
"Time:" = "Tid:";

"Enable User Code" = "Aktivera användarkod";
"Pop up Every Time" = "Visa varje gång";
"User Code Always Blank" = "Användarkoden är alltid tom";
"OK" = "OK";
"Cancel" = "Avbryt";
"Enable Specify Time" = "Ange utskriftstid";

"Folder Number" = "Mappnummer";
"Folder Number:" = "Mappnummer:";

"Folder Password" = "Mapplösenord";
"Folder Password:" = "Mapplösenord:";

"Normal Print" = "Normal utskrift";
"Sample Print" = "Provutskrift";
"Locked Print" = "Säker utskrift";
"Hold Print" = "Utskriftskö";
"Stored Print" = "Lagrad utskrift";
"Store and Print" = "Lagra och skriv ut";
"Document Server" = "Dokumentserver";

"(4-8 digits)" = "(4-8 siffror.)";

"Enter a valid File Name" = "Ange ett giltigt filnamn.";
"Enter a valid Password" = "Ange ett giltigt lösenord.";
"Enter a valid User Code" = "Ange en giltig användarkod.";
"Enter a valid User ID" = "Ange ett giltigt användar-ID.";
"Enter a valid Folder Password" = "Ange ett giltigt mapplösenord.";

"(Up to 8 alphanumeric characters)" = "(Max 8 alfanumeriska tecken.)";
"(Up to 16 alphanumeric characters)" = "(Max 16 alfanumeriska tecken.)";
"(4 digits)" = "(4-8 siffror.)";
"(Up to 8 digits)" = "(4-8 siffror.)";